---
kind: method
id: M:Autodesk.Revit.DB.ElementRecord.IsAnElementType
source: html/ed297826-fa62-0e5c-d6b5-9e7d19fe143b.htm
---
# Autodesk.Revit.DB.ElementRecord.IsAnElementType Method

Identifies if the element record represents an ElementType.

## Syntax (C#)
```csharp
public bool IsAnElementType()
```

## Returns
True if the element record represents an ElementType.